MaxLell/MicroPacControllerMan/Firmware/ThirdParty/STM32_U545RE_HAL/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u5xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define USER_BUTTON_Pin GPIO_PIN_13
#define USER_BUTTON_GPIO_Port GPIOC
#define JOYSTICK_NORTH_Pin GPIO_PIN_0
#define JOYSTICK_NORTH_GPIO_Port GPIOC
#define DISPLAY_TE_Pin GPIO_PIN_0
#define DISPLAY_TE_GPIO_Port GPIOA
#define DISPLAY_RESET_Pin GPIO_PIN_1
#define DISPLAY_RESET_GPIO_Port GPIOA
#define JOYSTICK_EAST_Pin GPIO_PIN_0
#define JOYSTICK_EAST_GPIO_Port GPIOB
#define DISPLAY_DSX_Pin GPIO_PIN_10
#define DISPLAY_DSX_GPIO_Port GPIOB
#define JOYSTICK_CENTER_Pin GPIO_PIN_6
#define JOYSTICK_CENTER_GPIO_Port GPIOC
#define DISPLAY_CS_Pin GPIO_PIN_7
#define DISPLAY_CS_GPIO_Port GPIOC
#define JOYSTICK_WEST_Pin GPIO_PIN_9
#define JOYSTICK_WEST_GPIO_Port GPIOC
#define JOYSTICK_SOUTH_Pin GPIO_PIN_4
#define JOYSTICK_SOUTH_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
